/*求x的y次方的最后n位数。

*输入格式:
*输入在一行中依次给出3个正整数x,y,n，其中x,y小于1000，n小于6。

*输出格式:
*输出n位数的结果即可，若不足n位，则在结果前补若干个0，直到n位。行末尾无多余空格和换行

*输入样例1:
*13 13 3
*输出样例1:
*253
*输入样例2:
*2 3 4
*输出样例2:
*0008

*/
#include<cstdio>

int main()
{
    int x,y,n;
    scanf("%d %d %d",&x,&y,&n);
    long long ans=1;
    int mod=1;
    for(int i=1;i<=n;i++){
        mod*=10;
    }
    for(int i=1;i<=y;i++){
        ans*=x;
        ans%=mod;
    }
   
   printf("%0*d\n",n,ans);
} 
/*[解题思路]
*1.使用循坏计算10^n作为取模的余数（mod）
*2.通过for循环累乘x，每次乘完后立刻对mod取余，防止数据溢出
*3，最后利用动态宽度%0*d进行输出，不足n位自动补零
*
*【防踩坑记录】
*一、一开始用int导致数据溢出，要改成long long
*二、输出时忘记补零 
*/
